# FileSaveDialog Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FileSaveDialog Constructor
FileSaveDialog Class See Also
---
Constructs a new instance of a File Save dialog.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public FileSaveDialog(
	string filter
)
```

Visual Basic
---
```text
Public Sub New ( _
	filter As String _
)
```

Visual C++
---
```text
public:
FileSaveDialog(
	String^ filter
)
```

# ### Parameters
filter
    Type: System..::..String The filter string. See the remarks for Filter for details.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The input filter string does not meet the minimal requirements for a valid filter string. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FileSaveDialog Class
Autodesk.Revit.UI Namespace